[
	{
		"title": "Augmented Reality Interactive Cube - Mobile and Web App",
		"img": "../../assets/ARCube.png",
		"body": "As an Emerging Technology Analyst at Accenture, I developed an Augmented Reality cube for design thinking sessions with Accenture stakeholders using Unity, C#, mobile device camera functions and image detection. I conducted end-to-end design process including user need validation and encompassed interviews, surveys, wireframing, usability testing, and documentation. Used C#, Unity, Blender, Adobe Creative Cloud, Swift, AR Kit, UI/UX Testing, Design Thinking, Data-Driven Story-telling methodologies.",
		"link": "https://docs.google.com/presentation/d/1X2aMJf5UpvAwC4iPsBnSWqXLmuMOaKRe05folEIOr1Q/edit#slide=id.g82b6cf23fa_0_961"
	},
	{
		"title": "Spotify Data Visualization Web App",
		"img": "/DesignJustice.png",
		"body": "Built a web-based Angular app that consumes Spotify Web API metadata to visually represent unique listening trends by user. Unique “fingerprint” image generated based upon metrics drawn from user listening trends. Additional features include hover over images to sample tracks, click to save to a playlist. Implemented JSON Web Tokens and Passport.js with OAuth 2.0 for Facebook login and registration.",
		"link": ""
	},
	{
		"title": "An Analysis of Blockchain for Social Impact Objectives",
		"img": "/BlockchainSocialImpact",
		"body": "As an undergraduate researcher, I presented a semester long research report analyzing the value add of Blockchain implementation and corresponding social impact industry objectives. Used Microsoft Suite, Data Analytics methodologies.",
		"link": "https://docs.google.com/presentation/d/1X2aMJf5UpvAwC4iPsBnSWqXLmuMOaKRe05folEIOr1Q/edit#slide=id.g82b6cf23fa_0_961"
	},
	{
		"title": "Stigma Surrounding Public Transit Analysis",
		"img": "../assets/PublicTransitStigma.png",
		"body": "In a class on Sustainable Urban Development, I conducted design and systems thinking analysis with a team to determine root causes of stigma surrounding public transit in Nashville, TN. We focused on systemic issues such as media representation, redlining, and bussing. We were named university level winners of the Map the System Global Challenge. Used Microsoft Suite, Data Analytics, Systems Thinking, and Design Thinking methodologies.",
		"link": "https://docs.google.com/presentation/d/1X2aMJf5UpvAwC4iPsBnSWqXLmuMOaKRe05folEIOr1Q/edit#slide=id.g82b6cf23fa_0_961"
	},
	{
		"title": "Forecast and Assessment of Quantum Computing Viability",
		"img": "",
		"body": "As an undergraduate researcher, I studied the technological and societal factors surrounding Quantum Computing technology and its development and adoption using various forecasting methodologies including Delphi, trend analysis, monitoring techniques, and scenario-based assessments. Used Microsoft Suite, Data Analytics, Reporting, Assessment, and Forecasting methodologies.",
		"link": ""
	},
	{
		"title": "Accessibility and Connected Health Product Development",
		"img": "",
		"body": "As a student consultant to a large telecommunications company affiliated with the Wond'ry Center for Innovation and Entrepreneurship, I worked with an interdisciplinary team of undergraduates, graduate students, and professors alongside industry subject matter experts on a year-long consulting project to identify and develop solutions for the company's Accessibility Team in the areas of Smart Home Technology and Connected Health. Used Microsoft Suite, Data Analytics, Systems Thinking, and Design Thinking and UI/UX methodologies.",
		"link": ""
	},
	{
		"title": "Innovation and Entrepreneurship Workshops, Programs, and Meetups",
		"img": "",
		"body": "As Innovation Ambassador at the Wond'ry Center for Innovation and Entrepreneurship, I lead curation of over 50 speaker programs, workshops, and meetups yearly bringing the Vanderbilt community together in an engaging, integrated, collaborative environment. Organized events including Blockchain 101, AR/VR Meetups, Design Thinking, Music Entrepreneurship, Human Resources, Equity Distribution, Brand Creation, & Prototyping. I also identified $2 million in grant opportunities and 11 calls for papers for programming, research projects, and student-led startups during 2017 - 2018 academic year. Part of my responsibilities included designing social media and marketing initiatives, during which we saw 55% growth in active followers and gained 3,000 views per post.",
		"link": ""
	},
	{
		"title": "Nashville Center for Nonprofit Management - Impact Measurement Report",
		"img": "/PublicTransitStigma",
		"body": "Designed impact measurement report that implemented growth metrics and KPIs for measuring and increasing the impact of Nashville Center for Nonprofit Management's nonprofit consulting engagements. Part of work as SCNO pro-bono consultant. Used Sketch, Data Analytics, Data Visualization, and Reporting methodologies.",
		"link": "https://docs.google.com/presentation/d/1X2aMJf5UpvAwC4iPsBnSWqXLmuMOaKRe05folEIOr1Q/edit#slide=id.g82b6cf23fa_0_961"
	},
	{
		"title": "Project 615 Web Design",
		"img": "../assets/PublicTransitStigma.png",
		"body": "As a pro bono software engineer, I redesigned the website, search engine optimization, and branding campaign strategies for Project 615 products to attract target audiences and build out e-commerce presence. This was part of my work as an SCNO pro-bono consultant. Used HTML, CSS, JavaScript, Figma, UI/UX methodologies.",
		"link": "https://project615.org"
	},
	{
		"title": "Design Justice Network",
		"img": "/DesignJustice.png",
		"body": "The Design Justice Network is an international community of people and organizations who are committed to rethinking design processes so that they center people who are too often marginalized by design. As a node member, I work according to a set of principles that were generated and collaboratively edited by our network.",
		"link": "https://designjustice.org/"
	},
	{
		"title": "Spelling Bee Web Application",
		"img": "../assets/SpellingBee.png",
		"body": "As an Associate Software Engineer in Capital One's Developer Academy (a 6-month bootcamp-style program designed to train non-CS college graduates from diverse backgrounds to be full-stack engineers) I built a web-based Anagram game using HTML, CSS, & vanilla JavaScript to replicate NYTimes mobile app. Implemented Merriam-Webster API, Scrabble-based letter randomization and probability algorithms. Added additional features including level logic and game timer. Used HTML, CSS, JavaScript, React.",
		"link": "https://docs.google.com/presentation/d/1X2aMJf5UpvAwC4iPsBnSWqXLmuMOaKRe05folEIOr1Q/edit#slide=id.g82b6cf23fa_0_961"
	},
	{
		"title": "Tinder Style Travel Itinerary Manger",
		"img": "/DesignJustice.png",
		"body": "Designed and built a web-based app using React that consumes web APIs from Google Maps and Yelp to create a travel itinerary manager with a swipe left, swipe right Tinder UI-inspired animation. Implemented JSON Web Tokens and Passport.js with OAuth 2.0 for Facebook login and registration.",
		"link": ""
	},
	{
		"title": "Coffee Shop Finder and Rater",
		"img": "/DesignJustice.png",
		"body": "Designed and built a geosocial networking service, web and mobile phone application using HTML, custom CSS, and Angular that consumes Google Maps and Yelp APIs to allow users to check in as they drink coffee, rate coffee shops based upon menu items, and share these check-ins, ratings and locations with other users. Implemented JSON Web Tokens and Passport.js with OAuth 2.0 for Google login and registration.",
		"link": ""
	}
]
