[
  {
    "title": "Barnes Visual Experience Platform (VxP)",
    "img": "/BarnesVxP.png",
    "img2": "",
    "body": "At the Barnes, we developed a first-of-its-kind Visual Experience Platform (VXP) specifically for teaching visual material—offering 360-degree views of galleries and synchronous and asynchronous delivery modes. Since we launched our first online class using the platform in January 2023, we have enrolled nearly 4,600 students in more than 110 online classes hosted on the VxP, with 14% of students receiving scholarships. In our post-course surveys, 76% of students reported that the class was highly or extremely impactful on how they perceive art, and 91% said the class inspired them to continue their learning. Students can explore the artworks on their own as well when the instructor enables independent exploration of the canvas. With built-in video conferencing capability built on AWS Chime, participants can interact in real-time, fostering a collaborative, participatory learning experience. Behind the scenes, the VXP is a React/GraphQL application that integrates AWS Chime video conferencing, IIIF deep-zoom tooling, and scalable AWS infrastructure. I’ve led the UI/UX design end-to-end process and component library development in Figma, ensured WCAG 2.1 accessibility compliance, and integrated analytics (GTM, Hotjar, GA) to optimize usability, perform user research, and inform our Impact and Evaluation metrics. These innovative digital programs expanded the Barnes Foundation’s mission-related services by growing and diversifying audiences, and created a new pathway for earned revenue. Building on this success, we now have a unique opportunity to become the leading provider for museum education, partnering with peer institutions as a producer, presenter, and distributor of digital arts education content. Most recently, we’re scaling the VXP to partner with peer museums and universities and host their content as well. I’ve been leading onboarding, training, and client success to support adoption and long-term partnerships. ",
    "link": "https://www.barnesfoundation.org/visual-experience-platform"
  },
  {
    "title": "Calder Gardens Sites & White-Label Museum Framework",
    "img": "/CalderGardensSite.png",
    "img2": "",
    "body": "As operating partner to the new Calder Gardens in Philadelphia, my team at the Barnes was tasked with taking designs from Karlsson Wilker and bringing them to life for caldergardens.org. Beyond the public-facing site, we also replicated the full Barnes digital ecosystem for Calder Garden’s audiences: a membership portal built around a new Dual Membership framework and digital wallet integration; a Donate site supporting Calder Gardens-specific contributions outside our ACME donation flow; a ticketing site implementing the new Barnes + Calder Gardens ticket model and logic; membership acquisition and renewal pages; and SMS ticketing sites adapted for the new Plus ticket type with expanded upsell paths (membership, tours, and ticket upgrades). The biggest challenge I was tasked with, was taking delivered brand guidelines in Figma that only covered the main site and extrapolating them to create a seamless, coherent Calder Gardens digital ecosystem. Together, these sites and commerce flows laid the groundwork for a white-label framework that enables us to launch museum experiences with shared infrastructure and institution-specific branding. On the engineering side, we worked in a mono-repo structured with NPM Workspaces, housing multiple Next.js applications (main site, donate, members, ticketing) and a Node/Express server deployed to AWS Lambda via API Gateway. Shared UI lives in a common workspace powered by Mantine, with theme overrides, Sass modules, a React/TypeScript component library and content is powered by headless CMS (Sanity). The architecture is multi-tenant and config-driven: brand, typography, color, and layout are injected via Mantine theme tokens; institution content and permissions live in separate CMS spaces; and ACME tenant credentials and routes are isolated per site. We set up Storybook for UI development, GitHub Actions for CI/CD, and PR workflows for visual review; added analytics (GTM + GA) and UX telemetry to inform the roadmap; and enforced WCAG 2.1 accessibility across shared components. This approach lets us stand up new digital museum ecosystems in the future quickly—reusing proven components and checkout patterns—while preserving each institution’s voice and design.",
    "link": "https://caldergardens.org/"
},
  {
    "title": "Barnes Live",
    "img": "/BarnesLive.png",
    "img2": "",
    "body": "In response to the pandemic, the Barnes rolled out an online education platform for adults and K-12 students in April 2020. We use AWS Interactive Video Service for the low latency live video feed and Stream for our chat. Everything here was locked into place using React and node.js, deployed via Serverless to AWS Lambda. In collaboration with our incredible Education team, we expanded local partnerships, which tripled the enrollment in online courses for adults, and allowed us to reach 40% more school-age students during the 2020-2021 school year compared to in-person courses in pre-pandemic years. We're continuing to update, maintain, and scale the platform for the 2021-2022 school year with exciting plans in the works for the future of art education.",
    "link": "https://aws.amazon.com/blogs/publicsector/barnes-foundation-takes-art-education-virtual-and-reaches-record-number-of-new-learners/"
  },
  {
    "title": "Barnes Online Collection",
    "img": "/OnlineCollection.png",
    "img2": "OnlineCollectionColor.png",
    "body": "The Barnes' Collection page is an incredible resource for exploring the collection and discovering new works. You can sort and search the collection by color, light, line and space (the four plastic means used in the Barnes method of art education). I've updated and maintained the site to reflect existing Barnes branding designed by our colleagues at Area17. In addition, I'm spearheading a Barnes branding style guide, for plug and play components and assets in future projects.",
    "link": "https://collection.barnesfoundation.org/"
  },
  {
    "title": "Barnes Membership Portal",
    "img": "/MemberSite.png",
    "img2": "",
    "body": "After our post-quarantine reopening, the Barnes wanted to make a membership portal for a more contactless experience for our members. This application offers convenient methods for a member to purchase tickets, display their membership card, and see updates from the Barnes via Firebase notifications. This application was spun up in TypeScript on the client and server, and data inside the application is pulled from our third party ticketing vendor ACME, which we built upon as our source of truth. Login was done via SMS authentication with AWS Pinpoint. I completed a redesign of the site in Fall 2021, and we've been able to use this site as the groundwork for other features like membership renewals, with have plans to scale further in future projects.",
    "link": ""
  },
  {
    "title": "Barnes SMS Ticketing",
    "img": "/SMS.png",
    "img2": "",
    "body": "Borrowing designs and SMS mechanisms from our membership site, we created our SMS ticketing website, which is sent to a guest before their scheduled arrival time. We added in a Tour Upgrade Feature, to enable guests to upgrade their GA tickets to tour tickets onsite, generating more revenue for the Barnes and offering a more in depth gallery experience.",
    "link": ""
  },
  {
    "title": "Augmented Reality Interactive Cube - Mobile and Web App",
    "img": "",
    "img2": "",
    "body": "As an Emerging Technology Analyst at Accenture, I developed an AR cube for design-thinking workshops using Unity, C#, ARKit, and mobile device image detection. I led the full design process—user research, wireframing, prototyping, usability testing—creating an immersive demo that showcased Accenture SaaS offerings in VR/AR-enabled sales contexts.",
    "link": ""
  },
  {
    "title": "An Analysis of Blockchain for Social Impact Objectives",
    "img": "",
    "img2": "",
    "body": "As an undergraduate researcher, I analyzed blockchain vendors and start-ups for supply chain and social impact applications. I presented a semester-long report on the risks and opportunities of blockchain adoption in nonprofit and procurement contexts, using Microsoft Suite data analytics and market trend forecasting.",
    "link": "https://docs.google.com/presentation/d/1NfYjcmzr6LwwNdaLbAIPokper-k0b8v7AeYCxTPzZWE/edit#slide=id.g35f391192_00"
  },
  {
    "title": "Forecast and Assessment of Quantum Computing Viability",
    "img": "",
    "img2": "",
    "body": "As an undergraduate researcher, I conducted scenario-based assessments of quantum computing, combining Delphi forecasting, trend analysis, and monitoring techniques to evaluate the social and technological viability of the field. This work culminated in a report on adoption pathways and barriers for quantum technologies.",
    "link": "/Forecast and Technology Assessment for Quantum Computing Technologies.pdf"
  },
  {
    "title": "Accessibility and Connected Health Product Consulting",
    "img": "",
    "img2": "",
    "body": "As a consultant via Vanderbilt’s Wond’ry Center for Innovation and Entrepreneurship, I worked with telecom industry experts to design accessibility-focused solutions in connected health and smart home technology. Using systems thinking and design-thinking methods, my interdisciplinary team produced a year-long report and prototypes to support the company’s Accessibility Team.",
    "link": ""
  },
  {
    "title": "Nashville Center for Nonprofit Management Impact Measurement Report",
    "img": "",
    "img2": "",
    "body": "I worked on a team of five to design an impact measurement framework for the Nashville Center for Nonprofit Management. We built growth metrics and KPIs to measure and increase the impact of their nonprofit consulting engagements. This work, part of my role as a pro-bono technology consultant, involved Sketch, data analytics, data visualization, and reporting methodologies.",
    "link": "https://docs.google.com/presentation/d/1h-8HcAelWPChHq8vE_o1qBu0DqWl-iqlshPLIluokjc/edit#slide=id.g4ef2e91f0b_1_76"
  },
  {
    "title": "Project 615 E-commerce and Web Design",
    "img": "",
    "img2": "",
    "body": "As a pro bono software engineer, I redesigned the Project 615 website, improved SEO, and created branding campaign strategies to reach new audiences and expand their e-commerce presence. This work, through SCNO consulting, combined HTML, CSS, JavaScript, and Figma with UI/UX best practices.",
    "link": "https://project615.com"
  },
  {
    "title": "Innovation and Entrepreneurship Workshops, Programs, and Meetups",
    "img": "",
    "img2": "",
    "body": "As Innovation Ambassador at the Wond’ry Center for Innovation and Entrepreneurship, I curated over 75 speaker programs, workshops, and meetups yearly, bringing the Vanderbilt community together across disciplines. I organized events like Blockchain 101, AR/VR meetups, and prototyping sessions, while also identifying $2M in grant opportunities and 11 calls for papers. My work also included social media strategy, which led to 55% growth in active followers and an average of 3,000 views per Facebook post within three months.",
    "link": ""
  }
]
